feat: auditoria
